// Z80 (Zed Eight-Ty) Interface
#include "burnint.h"
//#include "gp2xmemfuncs.h"

#define MAX_Z80		8
static struct ZetExt * ZetCPUContext[MAX_Z80] = { NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL };
int cpucore[MAX_Z80];

//extern void DaveZ80EnterCPU(unsigned char *, void *);

typedef UINT8 (__fastcall *pZetInHandler)(UINT16 a);
typedef void (__fastcall *pZetOutHandler)(UINT16 a, UINT8 d);
typedef UINT8 (__fastcall *pZetReadHandler)(UINT16 a);
typedef void (__fastcall *pZetWriteHandler)(UINT16 a, UINT8 d);

/*extern int ZET_IRQSTATUS_NONE;
extern int ZET_IRQSTATUS_ACK;
extern int ZET_IRQSTATUS_AUTO;
*/
struct ZetExt {
	Z80_Regs reg;

	UINT8* pZetMemMap[0x100 * 4];

	pZetInHandler ZetIn;
	pZetOutHandler ZetOut;
	pZetReadHandler ZetRead;
	pZetWriteHandler ZetWrite;

	UINT8 BusReq;

	  unsigned int Z80A;            // 0x00 - A Register:   0xAA------
  unsigned int Z80F;            // 0x04 - F Register:   0x------FF
  unsigned int Z80BC;           // 0x08 - BC Registers: 0xBBCC----
  unsigned int Z80DE;           // 0x0C - DE Registers: 0xDDEE----
  unsigned int Z80HL;           // 0x10 - HL Registers: 0xHHLL----
  unsigned int Z80PC;           // 0x14 - PC Program Counter (Memory Base + PC)
  unsigned int Z80PC_BASE;      // 0x18 - PC Program Counter (Memory Base)
  unsigned int Z80SP;           // 0x1C - SP Stack Pointer (Memory Base + PC)
  unsigned int Z80SP_BASE;      // 0x20 - SP Stack Pointer (Memory Base)
  unsigned int Z80IX;           // 0x24 - IX Index Register
  unsigned int Z80IY;           // 0x28 - IY Index Register
  unsigned int Z80I;            // 0x2C - I Interrupt Register
  unsigned int Z80A2;           // 0x30 - A' Register:    0xAA------
  unsigned int Z80F2;           // 0x34 - F' Register:    0x------FF
  unsigned int Z80BC2;          // 0x38 - B'C' Registers: 0xBBCC----
  unsigned int Z80DE2;          // 0x3C - D'E' Registers: 0xDDEE----
  unsigned int Z80HL2;          // 0x40 - H'L' Registers: 0xHHLL----
  unsigned char Z80_IRQ;        // 0x44 - Set IRQ Number
  unsigned char Z80IF;          // 0x45 - Interrupt Flags:  bit1=_IFF1, bit2=_IFF2, bit3=_HALT
  unsigned char Z80IM;          // 0x46 - Set IRQ Mode
  unsigned char spare;          // 0x47 - N/A
  unsigned int z80irqvector;    // 0x48 - Set IRQ Vector i.e. 0xFF=RST

  int nEI;
  int nCyclesLeft;
  int nCyclesTotal;
  int nCyclesSegment;
  int nInterruptLatch;

  void (*z80_irq_callback )(void);

  //void (*z80_write8 )(unsigned char d,unsigned short a);
  void (*z80_write8 )(unsigned short a, unsigned char d);
  void (*z80_write16 )(unsigned short d,unsigned short a);

  unsigned char (*z80_in)(unsigned short p);
  void (*z80_out )(unsigned short p,unsigned char d);

  unsigned char (*z80_read8)(unsigned short a);
  unsigned short (*z80_read16)(unsigned short a);

  unsigned int (*z80_rebaseSP)(unsigned short new_sp);
  unsigned int (*z80_rebasePC)(unsigned short new_pc);

  // Memory access
  unsigned char ** ppMemFetch;
  unsigned char ** ppMemFetchData;
  unsigned char ** ppMemRead;
  unsigned char ** ppMemWrite;

  void (*debugCallback)(unsigned short pc, unsigned int d);

};

static INT32 nZetCyclesDone[MAX_Z80];
